/* 
   Second C-style program  - Обчислення температури по Фаренгейту
*/
#include <stdio.h> // Бібліотека стандартного вводу-виводу 
              //(без неї нема printf та scanf)                       
int main(){    //  точка входу 
              // Визначення та/або ініціалізація локальних змінних
  float F, C;   //визначаємо відразу дві дійсні – змінні ‘F’ та ‘C’ 
   printf(“F=”); // виводимо підказку для користувача
   scanf("%f", &F); // введення змінної ‘F’
  C=(F-32)*5/9;   /*  Обчислення за формулою */
   printf("Celsius C=%e\n",С); /* виведення значення змінної ‘C’ в науковому форматі  */
 }
