#include <stdio.h>
#include <inttypes.h>
int main(){
    printf("123 = %d\n", 123);
    printf("0123 = %d\n", 0123);
    printf("0x123 = %d\n", 0x123);
    printf("12345678901234567890ull = %Lu\n", 12345678901234567890ull);
    // цей тип 64-бітовий (unsigned long long або можливо unsigned long)
    // навіть без суфіксу long 
    printf("12345678901234567890u = %"PRIu64"\n", 12345678901234567890u );
 
//  printf("%lld\n", -9223372036854775808); // ПОМИЛКА
// величина 9223372036854775808 за межами типу signed long long, що є наійбільшим типом дозволеним для беззнакового та безсуфіксного тип
    printf("%llu\n", -9223372036854775808ull );
    /* унарний мінус застосований	 до беззнакового числа віднімає його від костанти 2^64, що дає беззнакове (unsigned)значення 9223372036854775808 */

    printf("%Ld\n", -9223372036854775807ull - 1);
    // коректна форма знакового значення (signed value)-9223372036854775808
}
