#include <stdio.h>
#include <inttypes.h>
int main(){
    printf("101 = %d\n", 101);
    printf("0101 = %d\n", 0101);
    printf("0x101 = %d\n", 0x100);
    printf("987654321987654321ull = %Lu\n", 987654321987654321ull);
           
    // цей тип 64-бітовий (unsigned long long або можливо unsigned long)
    // навіть без суфіксу long 
    printf("987654321987654321u = %"PRIu64"\n", 987654321987654321u );
 
//  printf("%lld\n", -987654321987654321); // ПОМИЛКА
// величина 9223372036854775808 за межами типу signed long long, що є наійбільшим типом дозволеним для беззнакового та безсуфіксного тип
    printf("%llu\n", -9223372036854775808ull );
    /* унарний мінус застосований	 до беззнакового числа віднімає його від костанти 2^64, що дає беззнакове (unsigned)значення 9223372036854775808 */

    printf("%Ld\n", -9223372036854775807ull - 1);
    // коректна форма знакового значення (signed value)-9223372036854775808
}

/*
101 = 101
0101 = 65
0x101 = 256
987654321987654321ull = 987654321987654321
987654321987654321u = 987654321987654321
9223372036854775808
-9223372036854775808

*/
