#include <iostream>
#include <clocale>

int main(){
    setlocale(LC_ALL, "ukr");
    int n;

    for(int i=0;i<3;i++){
        std::cout<<"n=";
        std::cin >> n;
        std::cout << "n*2 = " << 2 * n << "\n";
        std::cout << "1/n = " << 1 / n << "\n";
        std::cout << "1+n=" << 1 + n << "\n";
        std::cout << "=================================" << "\n";
    }
    std::cout<<"Програма виконала 3 ітерації циклу";
}

/*
n=1
n*2 = 2
1/n = 1
1+n=2
=================================
n=2
n*2 = 4
1/n = 0
1+n=3
=================================
n=3
n*2 = 6
1/n = 0
1+n=4
=================================
Програма виконала 3 ітерації циклу
*/

/*
n=1
n*2 = 2
1/n = 1
1+n=2
=================================
n=0
n*2 = 0
Исключение в операции с плавающей точкой
*/
