#include <iostream>
#include <clocale>

int main(){
    setlocale(LC_ALL, "ukr");
    int n;

    for(int i=0;i<3;i++){
        std::cout<<"n=";
        std::cin >> n;
        std::cout << "n*2 = " << 2 * n << "\n";
        
        try { // тут код, який може викликати помилку
            if (n == 0) {
                throw 42; // генерувати ціле число 42
            }
           std::cout << "1/n = " << 1 / n << "\n";
        }
        catch (int thr) { // сюди передається число, яке згенерував throw
            std::cout << "Помилка №" << thr << " - ділення на 0!!!" << '\n';
        }
        std::cout << "1+n=" << 1 + n << "\n";
        std::cout << "=================================" << "\n";
    }
    std::cout<<"Програма виконала 3 ітерації циклу";
}



/*
n=1
n*2 = 2
1/n = 1
1+n=2
=================================
n=0
n*2 = 0
Помилка №42 - ділення на 0!!!
1+n=1
=================================
n=2
n*2 = 4
1/n = 0
1+n=3
=================================
Програма виконала 3 ітерації цикл
*/
