#include <stdio.h>
int main()
{
  {
      int x = 10, y  = 20;
      {
          // зовнішній блок x та y, тому
          // наступні команди коректні та друкують 10 and 20
          printf("x = %d, y = %d\n", x, y);
          {
              // y декларуються знову, тому зовнішнє y не доступне в цьому блоці
              int y = 40;
              x++;  // Змінює x до 11
              y++;  // Змінює y до 41
              printf("x = %d, y = %d\n", x, y);
          }
          // Ця команда стосується змінних зовнішнього блоку
          printf("x = %d, y = %d\n", x, y);
      }
  }
  return 0;
}
