#include <stdio.h>

#define size 25 /* створили константу - розмір. Якщо ми б її не створили, то в кожному з циклів ми були б змушені писати 25, що не лише непотрібно, але й погано з точки зору зрозумілості та гнучкості коду. У даному випадку для зміни розміру масивів потрібно переписати лише один рядок коду .*/

int main (){

double arr[size] = {5}; /* Далі ми заповнили масив за допомогою першого способу */
for (size_t i=0; i<size; ++i){
printf("arr[%lu]=%lf \n",i,arr[i]);
} /* елементи масиву наступні: 5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0 (24 нулі). */
for (size_t i=0; i<size; ++i){
   scanf("%lf",&arr[i]); /* далі за допомогою циклу ми виводимо всі елементи масиву*/
}
/* Таким чином, елементи можна виводити на екран. по суті на даному моменті ми можемо вважати елементи масиву як змінні, а змінні можна виводити. */
for (int i=0; i<size; ++i){
printf("arr[%d]=%lf,\t" ,i,arr[i]);
}
/* ми вводимо значення елементів у циклі. також варто замітити, що ми вводимо і елемент з індексом 0, який до цього був рівний 5. тобто значення елементів можна змінювати.*/
getchar();
}
